#include <iostream>

using namespace std;

int solution(int n, int a, int b)
{

    int round = 1;

    // a와 b a가 무조건 작게 바꿔준다.
    if (a > b)
        swap(a, b);


    // 남은수가 1이될때까지 토너먼트 진행한다.
    while (n > 1)
    {
//=================================================================================
        if ((a + 1 == b) && (a % 2 == 1)) // 토너먼트에서 만났다면 바로 끝
            return round;
//=================================================================================        
        // 토너먼트에서 못만났다면 다음라운드로 진출
        ++round;
//=================================================================================




//=================================================================================
        // 다음 라운드의 인덱스로 업데이트해주기
        // 나누어 떨어지면 바로 다음인덱스되는거고
        // 나누어 안떨어지면 +1 해줘야 다음 인덱스가된다.
        if (a % 2 != 0) // 나누어 떨어지지 않는다면./
        {
            a = (a / 2) + 1; // +1
        }
        else
        {
            a = a / 2;
        }

        if (b % 2 != 0) // 나누어 떨어지지 않는다면./
        {
            b = (b / 2) + 1; // +1
        }
        else
        {
            b = b / 2;
        }
//=================================================================================

        n = n / 2; // 무조건 나누어 떨어짐 짝수로 문제 제한사항 지수승 


    }

    
    return round;
  
}

int main(void)
{
    int sol1 = solution(8, 4, 7);
    int sol2 = solution(2, 1, 2);

    return 0;
}